import java.util.Scanner;
/**Задача №2940. МКАД
 Длина Московской кольцевой автомобильной дороги —109 километров. Байкер Вася стартует с нулевого километра МКАД и едет со скоростью v километров в час. На какой отметке он остановится через t часов?

 Входные данные
 Программа получает на вход значения v и t. Если v>0, то Вася движется в положительном направлении по МКАД,
 если же значение v<0, то в отрицательном.

 Выходные данные
 Программа должна вывести целое число от 0 до 108 — номер отметки, на которой остановится Вася.

 Примеры
 входные данные
 60
 2
 выходные данные
 11
 входные данные
 -1
 1
 выходные данные
 108
 */
public class MKAD {
    public static void main(String[] args) {
        Scanner scn = new Scanner(System.in);
        int v = scn.nextInt();
        int t = scn.nextInt();
        if (v>0){
            System.out.println((v*t) % 109);
        }else System.out.println(((v*t)+109) % 109);
        /**вроде всё правильно, но сайт выводит сообщение "Частичное решение".
         * Пробовал по-разному, остановился на этом варианте
         * 06 июля 2021 года
         */

    }
}
